using System;
using FloatingCharacter;
using System.Linq;
using TableMaker;

namespace TableMaker.Sample {
    class Program {

        static void A1() {
            var data = new[,] {
                { "ปรับตัวรับมือกับเทคโนโลยีดิจิทัลกันอย่างคึกคัก", "เชื้อชาติ", "3803" },
                { "ซอฟต์แวร์ออกแบบเชิงวิศวกรรมชื่อดัง", "ภาษาไทยมีปัญหาสระลอย", "3803" },
                { "ซอฟต์แวร์ออกแบบเชิงวิศวกรรมชื่อดัง", "ภาษาไทยมีปัญหาสระลอย", "0" },
                { "ขี่ช้าง", "ภาษาไทยมีปัญหาสระลอย", "3" },
                { "ซอฟต์แวร์ออกแบบเชิงวิศวกรรมชื่อดัง", "ชี้ชี้ชี้", "3974" },
                { "อู่อู้", "ก็อ๋อชี้ชี้ชี้", "s803" },
                { "อู่อู้", "อี้อี้อี้อี่อี่", "x3" }
            };
            ArrayPrinter.PrintToConsole(data);
        }

        static void A2() {
            var data = new[,] {
                { "ปรับตัวรับมือกับเทคโนโลยีดิจิทัลกันอย่างคึกคัก", "เชื้อชาติ" },
                { "ซอฟต์แวร์ออกแบบเชิงวิศวกรรมชื่อดัง", "ภาษาไทยมีปัญหาสระลอย"},
                { "ซอฟต์แวร์ออกแบบเชิงวิศวกรรมชื่อดัง", "ภาษาไทยมีปัญหาสระลอย"},
                { "ขี่ช้าง", "ภาษาไทยมีปัญหาสระลอย"},
                { "ซอฟต์แวร์ออกแบบเชิงวิศวกรรมชื่อดัง", "ชี้ชี้ชี้"},
                { "อู่อู้", "ก็อ๋อชี้ชี้ชี้"},
                { "อู่อู้", "อี้อี้อี้อี่อี่"}
            };
            ArrayPrinter.PrintToConsole(data);
        }
        static void Main(string[] args) {
            A1();
            A2();
        }
    }
}
